import pandas as pd
from sklearn.preprocessing import LabelEncoder

# read data
# =============================================================================
df = pd.read_csv("data/data_features2.csv",
                          encoding="big5")
# =============================================================================


# table
# =============================================================================
# columns = df['建物型態']
# for var in columns:
#     print(df[var].value_counts())
# =============================================================================



# 處理缺失值: 類別欄位
# null_df = df.isnull().sum()
# =============================================================================

# 出現次數最多的類別: '主要建材', '主要用途', '移轉層次'
# ---------------------------------------
null_columns = df[['主要建材', '主要用途', '移轉層次']]

for column in null_columns:
    # 統計每個類別的出現次數
    counts = df[column].value_counts()
    # 找出出現次數最多的類別
    most_common = counts.index[0]
    # 補
    df[column].fillna(most_common, inplace = True)
# ---------------------------------------


# 新增"未知"欄位: '都市土地使用分區'
# ---------------------------------------
# 對缺失值補"unknown"
df['都市土地使用分區'].fillna('Unknown', inplace = True)
# ---------------------------------------
# =============================================================================



# 儲存
# =============================================================================
df.to_csv('data/data_features2.csv', index = False, encoding = "big5")
# =============================================================================
df2 = df


# one hot encoding
# =============================================================================
# df2 = pd.get_dummies(df2, columns=['都市土地使用分區'])
# =============================================================================



# binary encoding
# =============================================================================
df2['建物現況格局-隔間'].replace(['有', '無'], [1,0], inplace = True)
df2['有無管理組織'].replace(['有', '無'], [1,0], inplace = True)
# =============================================================================



# label encoding: '主要建材','主要用途','交易標的', '建物型態','移轉層次','鄉鎮市區','location_type','nearest_tarin_station'
# =============================================================================
le = LabelEncoder()
labeled_data = df2[['主要建材',
                              '主要用途',
                              '交易標的',
                              '建物型態',
                              '移轉層次',
                              'location_type',
                              'nearest_tarin_station',
                              '都市土地使用分區']]
labeled_data = labeled_data.apply(le.fit_transform)

# 把轉換後的欄位存回原本的df
labeled_data_columnName = labeled_data.columns.tolist()

## 把相同欄位名稱用轉換後的資料取代
def replace_column_values(A, B, column_name):
  A[column_name] = B[column_name]
replace_column_values(df2, labeled_data, labeled_data_columnName)
# =============================================================================



# OrdinalEncoder
# =============================================================================
# 鄉鎮市區
# 大安區
# 松山區
# 中正區
# 信義區
# 中山區
# 南港區
# 大同區
# 內湖區
# 文山區
# 萬華區
# 士林區
# 北投區

df2['鄉鎮市區'].replace(['大安區', '松山區', '中正區', '信義區', '中山區', '南港區', '大同區', '內湖區', '文山區', '萬華區', '士林區', '北投區'], [12,11,10, 9 ,8, 7, 6, 5, 4, 3, 2, 1], inplace = True)


# =============================================================================


# 儲存
# =============================================================================

df2.to_csv('data/data_features4.csv', index = False, encoding = "big5")

# =============================================================================
